package com.facebook.model.posts;

/**
 * Типи постів, які можна опублікувати на платформі.
 * <p>
 * Він використовується для вказівки, чи є даний пост оригінальним вмістом,
 * або ж репостом іншого посту.
 * </p>
 * <ul>
 *     <li>{@link #POST} - Оригінальний пост, створений користувачем.
 *                       Відображає унікальний вміст, який було додано користувачем.</li>
 *     <li>{@link #REPOST} - Репост існуючого посту. Використовується, коли користувач
 *                 хоче поділитися вмістом іншого користувача зі своїми підписниками.</li>
 * </ul>
 */
public enum PostType {
    POST, REPOST
}
